//ZMPCCARG PROC                                                         00010002
//********************************************************************
//* CARGA DE ESTRATOS PARA MIGRACION Y PARAMETROS                    *
//********************************************************************
//ZMPCARG1 EXEC PGM=IKJEFT01                                            01125500
//E1DMENT1 DD DSN=MXC&AMB..ZM.FIX.DESCARGA.ACOESTZ,DISP=SHR             01126600
//E1DMENT2 DD DSN=MXC&AMB..ZM.FIX.DESCARGA.APEROPE,DISP=SHR             01126600
//E1DMENT3 DD DSN=MXC&AMB..ZM.FIX.DESCARGA.ESTZONE,DISP=SHR             01126600
//E1DMENT4 DD DSN=MXC&AMB..ZM.FIX.DESCARGA.REGSERV,DISP=SHR             01126600
//E1DMENT5 DD DSN=MXC&AMB..ZM.FIX.DESCARGA.ZMDT630,DISP=SHR             01126600
//E1DMENT6 DD DSN=MXC&AMB..ZM.FIX.DESCARGA.ZMDT650,DISP=SHR             01126600
//E1DMENT7 DD DSN=MXC&AMB..ZM.FIX.DESCARGA.PARAM,DISP=SHR               01126600
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSDBOUT DD SYSOUT=*
//SYSABOUT DD DUMMY
//SYSUDUMP DD DUMMY
//SYSPUNCH DD DUMMY
//QRLSDB2  DD SYSOUT=*
//SYSTSIN  DD DSN=ZIVA.ZME.CONTROL(ZMCTCARG),DISP=SHR                   01127700
//*                                                                     01127800
