//ZMPDBLOQ PROC
//*-------------------------------------------------------------------*
//PASO000 EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//*---------------------------------------------------------------------00050000
//*         DESCARGA DE QUERY ZMDT107
//*---------------------------------------------------------------------00050000
//PASO002  EXEC PGM=ADUUMAIN,COND=(4,LT),                                0008200
//         PARM='MXP1,PASO002,NEW,,MSGLEVEL(1)'                         00083000
//STEPLIB  DD DISP=SHR,DSN=BMC.DB2.MXP1.LOAD
//         DD DISP=SHR,DSN=LDB2MXP1.DBP1.SDSNEXIT
//         DD DISP=SHR,DSN=LDB2MXP1.DBP1.SDSNLOAD
//SYSREC   DD DSN=MXCP.ZM.TMP.ZMPDBLOQ.F&FECHA..DESDT107,               00089000
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,                        00090000
//            SPACE=(CYL,(350,90),RLSE),                                00100000
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)                         00110000
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSCNTL  DD DUMMY
//SYSIN    DD DSN=ZIVA.ZME.CONTROL(ZMCDPO22),DISP=SHR
//*---------------------------------------------------------------------
//*------   ARCHIVO CUENTA ORDENADO
//*---------------------------------------------------------------------
//PASO004 EXEC PGM=ICEMAN,COND=(4,LT)
//SORTIN  DD DSN=MXCP.ZM.FIX.CUENTA.ZMPCDECU.F&FECHA..P1,DISP=SHR
//SORTOUT DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..CUENTAOR,
//             DISP=(NEW,CATLG,DELETE),UNIT=3390,
//             SPACE=(CYL,(350,90),RLSE),
//             DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSCNTL  DD DUMMY
//SYSIN    DD DSN=ZIVA.ZME.CONTROL(ZMCDPO25),DISP=SHR
//*---------------------------------------------------------------------
//*------ ARCHIVO FLITRO FECH ACTUAL A 6 MESES OPERA               ----*
//*--------------------------------------------------------------------*
//PASO005  EXEC PGM=ICEMAN,COND=(4,LT)
//SORTIN  DD DSN=MXCP.ZM.TMP.OPERA,DISP=SHR
//SORTOUT DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..EN6YFAOP,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(350,90),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSCNTL  DD DUMMY
//SYSIN    DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..SALSORT1,DISP=SHR
//*---------------------------------------------------------------------
//*------ ARCHIVO FLITRO ENTRE 6 Y 12 MESES OPERA                     --
//*---------------------------------------------------------------------
//PASO006  EXEC PGM=ICEMAN,COND=(4,LT)
//SORTIN  DD DSN=MXCP.ZM.TMP.OPERA,DISP=SHR
//SORTOUT DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..EN6Y12OP,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(350,90),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSCNTL  DD DUMMY
//SYSIN    DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..SALSORT2,DISP=SHR
//*---------------------------------------------------------------------
//*------ ARCHIVO FLITRO FECH ACTUAL A 6 MESES ZMDT107
//*---------------------------------------------------------------------
//PASO007  EXEC PGM=ICEMAN,COND=(4,LT)
//SORTIN  DD DSN=MXCP.ZM.TMP.ZMPDBLOQ.F&FECHA..DESDT107,DISP=SHR
//SORTOUT DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..E6YFA107,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(350,90),RLSE),
//*           DCB=(DSORG=PS,LRECL=266,RECFM=FB,BLKSIZE=0)
//            DCB=(DSORG=PS,LRECL=272,RECFM=FB,BLKSIZE=0)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSCNTL  DD DUMMY
//SYSIN    DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..SALSORT3,DISP=SHR
//*---------------------------------------------------------------------
//*------ ARCHIVO FLITRO ENTRE 6 Y 12 MESES ZMDT107
//*---------------------------------------------------------------------
//PASO008  EXEC PGM=ICEMAN,COND=(4,LT)
//SORTIN  DD DSN=MXCP.ZM.TMP.ZMPDBLOQ.F&FECHA..DESDT107,DISP=SHR
//SORTOUT DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..E6Y12107,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(350,90),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSCNTL  DD DUMMY
//SYSIN    DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..SALSORT4,DISP=SHR
//*---------------------------------------------------------*
//*------ ARCHIVO FLITRO MAS DE 12 MESES ZMDT107
//*---------------------------------------------------------*
//PASO009  EXEC PGM=ICEMAN,COND=(4,LT)
//SORTIN  DD DSN=MXCP.ZM.TMP.ZMPDBLOQ.F&FECHA..DESDT107,DISP=SHR
//SORTOUT DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..MAY12M07,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(350,90),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSCNTL  DD DUMMY
//SYSIN    DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..SALSORT5,DISP=SHR
//*---------------------------------------------------------*
//*------ ARCHIVO FLITRO FECH MAYOR 6 MESES OPERA
//*---------------------------------------------------------*
//PASO010  EXEC PGM=ICEMAN,COND=(4,LT)
//SORTIN  DD DSN=MXCP.ZM.TMP.OPERA,DISP=SHR
//SORTOUT DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..MAY12MOP,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(350,90),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSCNTL  DD DUMMY
//SYSIN    DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..SALSORT6,DISP=SHR
//*--------------------------------------------------------------------*
//*------ ARCHIVO FLITRO FECH MAYOR 6 MESES OPERA
//*--------------------------------------------------------------------*
//PASO011  EXEC PGM=ICEMAN,COND=(4,LT)
//SORTIN  DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..E6YFA107,DISP=SHR
//SORTOUT DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..SORT.E6YFA107,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(350,90),RLSE),
//*            DCB=(DSORG=PS,LRECL=266,RECFM=FB,BLKSIZE=0)
//             DCB=(DSORG=PS,LRECL=272,RECFM=FB,BLKSIZE=0)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSCNTL  DD DUMMY
//SYSIN    DD DSN=ZIVA.ZME.CONTROL(ZMCDPO32),DISP=SHR
//*--------------------------------------------------------------------*
//*------ ARCHIVO FLITRO FECH MAYOR 6 MESES OPERA
//*--------------------------------------------------------------------*
//PASO012  EXEC PGM=ICEMAN,COND=(4,LT)
//SORTIN  DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..EN6YFAOP,DISP=SHR
//SORTOUT DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..SORT.EN6YFAOP,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(350,90),RLSE),
//*            DCB=(DSORG=PS,LRECL=266,RECFM=FB,BLKSIZE=0)
//             DCB=(DSORG=PS,LRECL=272,RECFM=FB,BLKSIZE=0)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSCNTL  DD DUMMY
//SYSIN    DD DSN=ZIVA.ZME.CONTROL(ZMCDPO32),DISP=SHR
//*--------------------------------------------------------------------*
//*------ ARCHIVO FLITRO FECH MAYOR 6 MESES OPERA
//*--------------------------------------------------------------------*
//PASO013  EXEC PGM=ICEMAN,COND=(4,LT)
//SORTIN  DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..SORT.EN6YFAOP,DISP=SHR
//        DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..SORT.E6YFA107,DISP=SHR
//SORTOUT DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..MOV6MES,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(350,90),RLSE),
//*            DCB=(DSORG=PS,LRECL=266,RECFM=FB,BLKSIZE=0)
//             DCB=(DSORG=PS,LRECL=272,RECFM=FB,BLKSIZE=0)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSCNTL  DD DUMMY
//SYSIN    DD DSN=ZIVA.ZME.CONTROL(ZMCDPO39),DISP=SHR
//*--------------------------------------------------
//* NO MATCH FEC ACT A 6 MESES OPERA - CUENTA
//*----------------------------------------------------
//PASM114  EXEC PGM=ICEMAN,COND=(4,LT)
//SORTJNF1 DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..CUENTAOR,DISP=SHR
//SORTJNF2 DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..MOV6MES,DISP=SHR
//SORTOUT  DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..BLOQ,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(350,90),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD DSN=ZIVA.ZME.CONTROL(ZMCDPO33),DISP=SHR
//*---------------------------------------------------------------------
//* NO MATCH FEC ACT A 6 MESES ZMDT107 - CUENTA CON RANGO A 12 MESES
//*---------------------------------------------------------------------
//PASM215  EXEC PGM=ICEMAN,COND=(4,LT)
//SORTJNF1 DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..BLOQ,DISP=SHR
//SORTJNF2 DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..E6Y12107,DISP=SHR
//SORTOUT  DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..B6Y1207,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(350,90),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSCNTL  DD DUMMY
//SYSIN    DD DSN=ZIVA.ZME.CONTROL(ZMCDPO26),DISP=SHR
//*----------------------------------------------------
//* MATCH MAS DE 12 MESES ZMDT107 - CUENTA BLOQUEO ILOCALIZABLES
//*----------------------------------------------------
//PASM316  EXEC PGM=ICEMAN,COND=(4,LT)
//SORTJNF1 DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..BLOQ,DISP=SHR
//SORTJNF2 DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..MAY12M07,DISP=SHR
//SORTOUT  DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..BMAY107,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(350,90),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSCNTL  DD DUMMY
//SYSIN    DD DSN=ZIVA.ZME.CONTROL(ZMCDPO27),DISP=SHR
//*---------------------------------------------------------------------
//* MATCH MAS DE 12 MESES OEPRA - CUENTA BLOQUEO ILOCALIZABLES
//*---------------------------------------------------------------------
//PASM417  EXEC PGM=ICEMAN,COND=(4,LT)
//SORTJNF1 DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..BLOQ,DISP=SHR
//SORTJNF2 DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..MAY12MOP,DISP=SHR
//SORTOUT  DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..BMAY12OP,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(350,90),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSCNTL  DD DUMMY
//SYSIN    DD DSN=ZIVA.ZME.CONTROL(ZMCDPO28),DISP=SHR
//*---------------------------------------------------------------------
//* MATCH MAS DE 12 MESES OEPRA - CUENTA BLOQUEO INACTIVOS OPERA
//*---------------------------------------------------------------------
//PASM518  EXEC PGM=ICEMAN,COND=(4,LT)
//SORTJNF1 DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..BLOQ,DISP=SHR
//SORTJNF2 DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..EN6Y12OP,DISP=SHR
//SORTOUT  DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..B6Y12OP,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(350,90),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSCNTL  DD DUMMY
//SYSIN    DD DSN=ZIVA.ZME.CONTROL(ZMCDPO28),DISP=SHR
//*---------------------------------------------------------------------
//* CONCATENA OPERA Y ZMDT107  NO MATCH  REVISAR SI APLICA
//*---------------------------------------------------------------------
//PASO019 EXEC PGM=ICEMAN,COND=(4,LT)
//SORTIN DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..B6Y1207,DISP=SHR
//       DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..B6Y12OP,DISP=SHR
//SORTOUT  DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..INACTIV,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(350,90),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD DSN=ZIVA.ZME.CONTROL(ZMCDPO29),DISP=SHR
//*---------------------------------------------------------------------
//* CONCATENA OPERA Y ZMDT107   BLOQUEO ILOCALIZABLE
//*---------------------------------------------------------------------
//PASO020 EXEC PGM=ICEMAN,COND=(4,LT)
//SORTIN DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..BMAY107,DISP=SHR
//       DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..BMAY12OP,DISP=SHR
//SORTOUT  DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..ILOCALI,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(350,90),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD DSN=ZIVA.ZME.CONTROL(ZMCDPO30),DISP=SHR
//*---------------------------------------------------------------------
//* CONCATENA CUENTAS INACTIVAS E ILOCALIZABLES
//*---------------------------------------------------------------------
//PASO021 EXEC PGM=ICEMAN,COND=(4,LT)
//SORTIN DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..INACTIV,DISP=SHR
//       DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..ILOCALI,DISP=SHR
//SORTOUT  DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..MATCHBLO,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(350,90),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD DSN=ZIVA.ZME.CONTROL(ZMCDPO31),DISP=SHR
//*---------------------------------------------------------------------
//* NO MATCH FEC ACT A 6 MESES OPERA - CUENTA
//*---------------------------------------------------------------------
//PASM622  EXEC PGM=ICEMAN,COND=(4,LT)
//SORTJNF1 DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..BLOQ,DISP=SHR
//SORTJNF2 DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..MATCHBLO,DISP=SHR
//SORTOUT  DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..FALTANCB,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(350,90),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD DSN=ZIVA.ZME.CONTROL(ZMCDPO34),DISP=SHR
//*--------------------------------------------------------------------*
//*------ ARCHIVO FLITRO FECH MAYOR 6 MESES OPERA
//*--------------------------------------------------------------------*
//PASO023  EXEC PGM=ICEMAN,COND=(4,LT)
//SORTIN  DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..FALTANCB,DISP=SHR
//SORTOUT DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..ILOCALCB,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(350,90),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSCNTL  DD DUMMY
//SYSIN    DD DSN=ZIVA.ZME.CONTROL(ZMCDPO35),DISP=SHR
//*--------------------------------------------------------------------*
//*------ ARCHIVO FILTRO FECH MAYOR 6 MESES OPERA
//*--------------------------------------------------------------------*
//PASO024  EXEC PGM=ICEMAN,COND=(4,LT)
//SORTIN  DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..ILOCALCB,DISP=SHR
//        DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..MATCHBLO,DISP=SHR
//SORTOUT DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..CTAABLOQ,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(350,90),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSCNTL  DD DUMMY
//SYSIN    DD DSN=ZIVA.ZME.CONTROL(ZMCDPO36),DISP=SHR
//*--------------------------------------------------------------------*
//*------ ARCHIVO FILTRO FECH MAYOR 6 MESES OPERA
//*--------------------------------------------------------------------*
//PASO24A  EXEC PGM=ICEMAN,COND=(4,LT)
//SORTIN  DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..CTAABLOQ,DISP=SHR
//SORTOUT DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..ORDEBLOQ,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(350,90),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSCNTL  DD DUMMY
//SYSIN    DD DSN=ZIVA.ZME.CONTROL(ZMCDPO40),DISP=SHR
//*--------------------------------------------------------------------*
//*------ ARCHIVO FILTRO FECH MAYOR 6 MESES OPERA
//*--------------------------------------------------------------------*
//PASO24B  EXEC PGM=ICEMAN,COND=(4,LT)
//SORTIN  DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..ORDEBLOQ,DISP=SHR
//SORTOUT DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..CTABBLOQ,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(350,90),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSCNTL  DD DUMMY
//SYSIN    DD DSN=ZIVA.ZME.CONTROL(ZMCDPO41),DISP=SHR
//*
//*---------------------------------------------------------------------
//*-  EJECUCION DE COBOL
//*---------------------------------------------------------------------
//PASO025 EXEC  PGM=IKJEFT1A,COND=(4,LT)
//*
//SYSTSPRT DD  SYSOUT=*
//SYSABOUT DD  SYSOUT=*
//SYSDBOUT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSOUP   DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//QRLSDB2  DD  SYSOUT=*
//*
//ISCUBLOQ DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..CTABBLOQ,
//            DISP=SHR
//OSSINCID DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..SALINCID,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(350,90),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//*CAMBIOS
//OSSINERR DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..REPORTEE,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(100,50),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//*CAMBIOS
//SYSIN    DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..SALSORT7,DISP=SHR
//SYSTSIN  DD DSN=ZIVA.ZME.CONTROL(ZMSCS003),DISP=SHR
//*
