//ZMPDBLO3 PROC
//*---------------------------------------------------------------------
//*-  EJECUCION DE COBOL
//*---------------------------------------------------------------------
//PASO001 EXEC  PGM=IKJEFT1A,COND=(4,LT)
//*
//SYSTSPRT DD  SYSOUT=*
//SYSABOUT DD  SYSOUT=*
//SYSDBOUT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSOUP   DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//QRLSDB2  DD  SYSOUT=*
//*
//OSSORT01 DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..SALSORT1,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(50,25),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//*
//OSSORT02 DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..SALSORT2,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(50,25),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//*
//OSSORT03 DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..SALSORT3,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(50,25),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//*
//OSSORT04 DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..SALSORT4,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(50,25),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//*
//OSSORT05 DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..SALSORT5,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(50,25),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//*
//OSSORT06 DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..SALSORT6,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(50,25),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//*
//OSSALFEC DD DSN=MXCP.ZM.FIX.ZMPDBLOQ.F&FECHA..SALSORT7,
//            DISP=(NEW,CATLG,DELETE),UNIT=3390,
//            SPACE=(CYL,(50,25),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0,DSORG=PS)
//SYSTSIN  DD DSN=ZIVA.ZME.CONTROL(ZMCDPO43),DISP=SHR
//*
